{"modelTopology":{"class_name":"Model","config":{"name":"model1","layers":[{"name":"tokenInput","class_name":"InputLayer","config":{"batch_input_shape":[null,10],"dtype":"int32","sparse":false,"name":"tokenInput"},"inbound_nodes":[]},{"name":"posInput","class_name":"InputLayer","config":{"batch_input_shape":[null,10],"dtype":"int32","sparse":false,"name":"posInput"},"inbound_nodes":[]},{"name":"token_embedding","class_name":"Embedding","config":{"input_dim":397,"output_dim":64,"embeddings_initializer":{"class_name":"RandomUniform","config":{"minval":-0.05,"maxval":0.05,"seed":null}},"embeddings_regularizer":null,"activity_regularizer":null,"embeddings_constraint":null,"mask_zero":null,"input_length":null,"name":"token_embedding","trainable":true,"batch_input_shape":[null,null]},"inbound_nodes":[[["tokenInput",0,0,{}]]]},{"name":"pos_embedding","class_name":"Embedding","config":{"input_dim":10,"output_dim":64,"embeddings_initializer":{"class_name":"RandomUniform","config":{"minval":-0.05,"maxval":0.05,"seed":null}},"embeddings_regularizer":null,"activity_regularizer":null,"embeddings_constraint":null,"mask_zero":null,"input_length":null,"name":"pos_embedding","trainable":true,"batch_input_shape":[null,null]},"inbound_nodes":[[["posInput",0,0,{}]]]},{"name":"add_Add1","class_name":"Add","config":{"name":"add_Add1","trainable":true},"inbound_nodes":[[["token_embedding",0,0,{}],["pos_embedding",0,0,{}]]]},{"name":"multi_head_attention","class_name":"MaskedMultiHeadAttention","config":{"name":"multi_head_attention","trainable":true,"num_heads":4,"embed_dim":64},"inbound_nodes":[[["add_Add1",0,0,{}]]]},{"name":"dropout_Dropout1","class_name":"Dropout","config":{"rate":0.1,"noise_shape":null,"seed":null,"name":"dropout_Dropout1","trainable":true},"inbound_nodes":[[["multi_head_attention",0,0,{}]]]},{"name":"add_Add2","class_name":"Add","config":{"name":"add_Add2","trainable":true},"inbound_nodes":[[["add_Add1",0,0,{}],["dropout_Dropout1",0,0,{}]]]},{"name":"layer_normalization_LayerNormalization1","class_name":"LayerNormalization","config":{"axis":[2],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization1","trainable":true},"inbound_nodes":[[["add_Add2",0,0,{}]]]},{"name":"dense_Dense1","class_name":"Dense","config":{"units":256,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization1",0,0,{}]]]},{"name":"dense_Dense2","class_name":"Dense","config":{"units":64,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2","trainable":true},"inbound_nodes":[[["dense_Dense1",0,0,{}]]]},{"name":"add_Add3","class_name":"Add","config":{"name":"add_Add3","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization1",0,0,{}],["dense_Dense2",0,0,{}]]]},{"name":"layer_normalization_LayerNormalization2","class_name":"LayerNormalization","config":{"axis":[2],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization2","trainable":true},"inbound_nodes":[[["add_Add3",0,0,{}]]]},{"name":"dense_Dense3","class_name":"Dense","config":{"units":397,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3","trainable":true},"inbound_nodes":[[["layer_normalization_LayerNormalization2",0,0,{}]]]}],"input_layers":[["tokenInput",0,0],["posInput",0,0]],"output_layers":[["dense_Dense3",0,0]]},"keras_version":"tfjs-layers 4.22.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"token_embedding/embeddings","shape":[397,64],"dtype":"float32"},{"name":"pos_embedding/embeddings","shape":[10,64],"dtype":"float32"},{"name":"multi_head_attention/wq","shape":[64,64],"dtype":"float32"},{"name":"multi_head_attention/wk","shape":[64,64],"dtype":"float32"},{"name":"multi_head_attention/wv","shape":[64,64],"dtype":"float32"},{"name":"multi_head_attention/wo","shape":[64,64],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization1/gamma","shape":[64],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization1/beta","shape":[64],"dtype":"float32"},{"name":"dense_Dense1/kernel","shape":[64,256],"dtype":"float32"},{"name":"dense_Dense1/bias","shape":[256],"dtype":"float32"},{"name":"dense_Dense2/kernel","shape":[256,64],"dtype":"float32"},{"name":"dense_Dense2/bias","shape":[64],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization2/gamma","shape":[64],"dtype":"float32"},{"name":"layer_normalization_LayerNormalization2/beta","shape":[64],"dtype":"float32"},{"name":"dense_Dense3/kernel","shape":[64,397],"dtype":"float32"},{"name":"dense_Dense3/bias","shape":[397],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.22.0","convertedBy":null}