{
  "wordIndex": {
    "<pad>": 0,
    "once": 1,
    "upon": 2,
    "a": 3,
    "time": 4,
    ",": 5,
    "there": 6,
    "was": 7,
    "little": 8,
    "boy": 9,
    "named": 10,
    "timmy": 11,
    ".": 12,
    "loved": 13,
    "to": 14,
    "play": 15,
    "outside": 16,
    "but": 17,
    "he": 18,
    "never": 19,
    "listened": 20,
    "his": 21,
    "mom": 22,
    "when": 23,
    "she": 24,
    "told": 25,
    "him": 26,
    "come": 27,
    "inside": 28,
    "before": 29,
    "dark": 30,
    "one": 31,
    "day": 32,
    "playing": 33,
    "saw": 34,
    "big": 35,
    "emergency": 36,
    "truck": 37,
    "with": 38,
    "flashing": 39,
    "lights": 40,
    "wanted": 41,
    "see": 42,
    "what": 43,
    "happening": 44,
    "so": 45,
    "ran": 46,
    "towards": 47,
    "it": 48,
    "didn't": 49,
    "the": 50,
    "hole": 51,
    "in": 52,
    "ground": 53,
    "and": 54,
    "fell": 55,
    "tried": 56,
    "yell": 57,
    "for": 58,
    "help": 59,
    "no": 60,
    "could": 61,
    "hear": 62,
    "started": 63,
    "get": 64,
    "scared": 65,
    "know": 66,
    "do": 67,
    "shrug": 68,
    "way": 69,
    "out": 70,
    "couldn't": 71,
    "eventually": 72,
    "timmy's": 73,
    "realized": 74,
    "missing": 75,
    "went": 76,
    "look": 77,
    "found": 78,
    "called": 79,
    "too": 80,
    "late": 81,
    "had": 82,
    "learned": 83,
    "hard": 84,
    "lesson": 85,
    "-": 86,
    "always": 87,
    "listen": 88,
    "be": 89,
    "careful": 90,
    "bird": 91,
    "pip": 92,
    "lived": 93,
    "tree": 94,
    "lots": 95,
    "of": 96,
    "branches": 97,
    "flying": 98,
    "around": 99,
    "bitter": 100,
    "fruit": 101,
    "on": 102,
    "branch": 103,
    "landed": 104,
    "said": 105,
    "\"": 106,
    "is": 107,
    "this": 108,
    "?": 109,
    "wise": 110,
    "old": 111,
    "owl": 112,
    "sitting": 113,
    "another": 114,
    "nearby": 115,
    "heard": 116,
    "pip's": 117,
    "question": 118,
    "that's": 119,
    "persimmon": 120,
    "it's": 121,
    "very": 122,
    "some": 123,
    "people": 124,
    "like": 125,
    "would": 126,
    "you": 127,
    "me": 128,
    "explain": 129,
    "more": 130,
    "about": 131,
    "nodded": 132,
    "head": 133,
    "continued": 134,
    "persimmons": 135,
    "are": 136,
    "fruits": 137,
    "that": 138,
    "grow": 139,
    "trees": 140,
    "they": 141,
    "orange": 142,
    "round": 143,
    "taste": 144,
    "until": 145,
    "ripe": 146,
    "then": 147,
    "become": 148,
    "sweet": 149,
    "delicious": 150,
    "eat": 151,
    "thanked": 152,
    "flew": 153,
    "away": 154,
    "feeling": 155,
    "grateful": 156,
    "new": 157,
    "knowledge": 158,
    "decided": 159,
    "try": 160,
    "sweetness": 161,
    "himself": 162,
    "clumsy": 163,
    "monkey": 164,
    "max": 165,
    "games": 166,
    "friends": 167,
    "jungle": 168,
    "game": 169,
    "tag": 170,
    "excited": 171,
    "forgot": 172,
    "watch": 173,
    "where": 174,
    "going": 175,
    "tripped": 176,
    "over": 177,
    "rock": 178,
    "max's": 179,
    "laughed": 180,
    "teased": 181,
    "mind": 182,
    "got": 183,
    "up": 184,
    "kept": 185,
    "however": 186,
    "during": 187,
    "accidentally": 188,
    "bit": 189,
    "friend's": 190,
    "tail": 191,
    "friend": 192,
    "upset": 193,
    "crying": 194,
    "felt": 195,
    "terrible": 196,
    "needed": 197,
    "from": 198,
    "made": 199,
    "sure": 200,
    "also": 201,
    "important": 202,
    "apologize": 203,
    "make": 204,
    "mistake": 205,
    "kind": 206,
    "others": 207,
    "together": 208,
    "extra": 209,
    "not": 210,
    "bite": 211,
    "anyone": 212,
    "again": 213,
    "red": 214,
    "barn": 215,
    "lot": 216,
    "hay": 217,
    "soft": 218,
    "yellow": 219,
    "nice": 220,
    "place": 221,
    "animals": 222,
    "sleep": 223,
    "tall": 224,
    "horse": 225,
    "sam": 226,
    "dependable": 227,
    "all": 228,
    "stand": 229,
    "by": 230,
    "them": 231,
    "everyone": 232,
    "liked": 233,
    "because": 234,
    "strong": 235,
    "chick": 236,
    "lost": 237,
    "find": 238,
    "her": 239,
    "stood": 240,
    "used": 241,
    "long": 242,
    "legs": 243,
    "move": 244,
    "finally": 245,
    "took": 246,
    "back": 247,
    "cheered": 248,
    "who": 249,
    "whale": 250,
    "deep": 251,
    "blue": 252,
    "sea": 253,
    "many": 254,
    "fish": 255,
    "crabs": 256,
    "problem": 257,
    "smelly": 258,
    "did": 259,
    "smell": 260,
    "thought": 261,
    "i": 262,
    "need": 263,
    "swam": 264,
    "covered": 265,
    "green": 266,
    "plants": 267,
    "rubbed": 268,
    "against": 269,
    "clean": 270,
    "were": 271,
    "happy": 272,
    "anymore": 273,
    "played": 274,
    "happily": 275,
    "ever": 276,
    "after": 277,
    "girl": 278,
    "amy": 279,
    "yard": 280,
    "purple": 281,
    "swing": 282,
    "high": 283,
    "sky": 284,
    "sunny": 285,
    "wow": 286,
    "!": 287,
    "want": 288,
    "smiled": 289,
    "okay": 290,
    "let's": 291,
    "turns": 292,
    "laughing": 293,
    "having": 294,
    "fun": 295,
    "swung": 296,
    "touch": 297,
    "while": 298,
    "tired": 299,
    "sat": 300,
    "down": 301,
    "grass": 302,
    "looked": 303,
    "at": 304,
    "each": 305,
    "other": 306,
    "have": 307,
    "spent": 308,
    "swinging": 309,
    "naughty": 310,
    "bee": 311,
    "buzzy": 312,
    "fly": 313,
    "bees": 314,
    "lucy": 315,
    "hi": 316,
    "yes": 317,
    "don't": 318,
    "how": 319,
    "moment": 320,
    "can": 321,
    "teach": 322,
    "we": 323,
    "pretty": 324,
    "flowers": 325,
    "taught": 326,
    "helped": 327,
    "sun": 328,
    "shining": 329,
    "brightly": 330,
    "clear": 331,
    "gentle": 332,
    "breeze": 333,
    "rustled": 334,
    "leaves": 335,
    "enjoying": 336,
    "beautiful": 337,
    "weather": 338,
    "park": 339,
    "taking": 340,
    "leisurely": 341,
    "stroll": 342,
    "along": 343,
    "riverbank": 344,
    "children": 345,
    "laughter": 346,
    "filled": 347,
    "air": 348,
    "as": 349,
    "turned": 350,
    "into": 351,
    "evening": 352,
    "temperature": 353,
    "drop": 354,
    "transformed": 355,
    "canvas": 356,
    "vibrant": 357,
    "colors": 358,
    "families": 359,
    "gathered": 360,
    "picnics": 361,
    "barbecues": 362,
    "wafted": 363,
    "through": 364,
    "perfect": 365,
    "picnic": 366,
    "lake": 367,
    "distance": 368,
    "sound": 369,
    "live": 370,
    "music": 371,
    "coming": 372,
    "local": 373,
    "band": 374,
    "began": 375,
    "gather": 376,
    "stage": 377,
    "enjoy": 378,
    "performance": 379,
    "atmosphere": 380,
    "electric": 381,
    "swaying": 382,
    "beat": 383,
    "stars": 384,
    "twinkle": 385,
    "night": 386,
    "crowd": 387,
    "grew": 388,
    "even": 389,
    "larger": 390,
    "festivities": 391,
    "well": 392,
    "joy": 393,
    "memories": 394,
    "last": 395,
    "lifetime": 396
  },
  "reverseMap": {
    "0": "<pad>",
    "1": "once",
    "2": "upon",
    "3": "a",
    "4": "time",
    "5": ",",
    "6": "there",
    "7": "was",
    "8": "little",
    "9": "boy",
    "10": "named",
    "11": "timmy",
    "12": ".",
    "13": "loved",
    "14": "to",
    "15": "play",
    "16": "outside",
    "17": "but",
    "18": "he",
    "19": "never",
    "20": "listened",
    "21": "his",
    "22": "mom",
    "23": "when",
    "24": "she",
    "25": "told",
    "26": "him",
    "27": "come",
    "28": "inside",
    "29": "before",
    "30": "dark",
    "31": "one",
    "32": "day",
    "33": "playing",
    "34": "saw",
    "35": "big",
    "36": "emergency",
    "37": "truck",
    "38": "with",
    "39": "flashing",
    "40": "lights",
    "41": "wanted",
    "42": "see",
    "43": "what",
    "44": "happening",
    "45": "so",
    "46": "ran",
    "47": "towards",
    "48": "it",
    "49": "didn't",
    "50": "the",
    "51": "hole",
    "52": "in",
    "53": "ground",
    "54": "and",
    "55": "fell",
    "56": "tried",
    "57": "yell",
    "58": "for",
    "59": "help",
    "60": "no",
    "61": "could",
    "62": "hear",
    "63": "started",
    "64": "get",
    "65": "scared",
    "66": "know",
    "67": "do",
    "68": "shrug",
    "69": "way",
    "70": "out",
    "71": "couldn't",
    "72": "eventually",
    "73": "timmy's",
    "74": "realized",
    "75": "missing",
    "76": "went",
    "77": "look",
    "78": "found",
    "79": "called",
    "80": "too",
    "81": "late",
    "82": "had",
    "83": "learned",
    "84": "hard",
    "85": "lesson",
    "86": "-",
    "87": "always",
    "88": "listen",
    "89": "be",
    "90": "careful",
    "91": "bird",
    "92": "pip",
    "93": "lived",
    "94": "tree",
    "95": "lots",
    "96": "of",
    "97": "branches",
    "98": "flying",
    "99": "around",
    "100": "bitter",
    "101": "fruit",
    "102": "on",
    "103": "branch",
    "104": "landed",
    "105": "said",
    "106": "\"",
    "107": "is",
    "108": "this",
    "109": "?",
    "110": "wise",
    "111": "old",
    "112": "owl",
    "113": "sitting",
    "114": "another",
    "115": "nearby",
    "116": "heard",
    "117": "pip's",
    "118": "question",
    "119": "that's",
    "120": "persimmon",
    "121": "it's",
    "122": "very",
    "123": "some",
    "124": "people",
    "125": "like",
    "126": "would",
    "127": "you",
    "128": "me",
    "129": "explain",
    "130": "more",
    "131": "about",
    "132": "nodded",
    "133": "head",
    "134": "continued",
    "135": "persimmons",
    "136": "are",
    "137": "fruits",
    "138": "that",
    "139": "grow",
    "140": "trees",
    "141": "they",
    "142": "orange",
    "143": "round",
    "144": "taste",
    "145": "until",
    "146": "ripe",
    "147": "then",
    "148": "become",
    "149": "sweet",
    "150": "delicious",
    "151": "eat",
    "152": "thanked",
    "153": "flew",
    "154": "away",
    "155": "feeling",
    "156": "grateful",
    "157": "new",
    "158": "knowledge",
    "159": "decided",
    "160": "try",
    "161": "sweetness",
    "162": "himself",
    "163": "clumsy",
    "164": "monkey",
    "165": "max",
    "166": "games",
    "167": "friends",
    "168": "jungle",
    "169": "game",
    "170": "tag",
    "171": "excited",
    "172": "forgot",
    "173": "watch",
    "174": "where",
    "175": "going",
    "176": "tripped",
    "177": "over",
    "178": "rock",
    "179": "max's",
    "180": "laughed",
    "181": "teased",
    "182": "mind",
    "183": "got",
    "184": "up",
    "185": "kept",
    "186": "however",
    "187": "during",
    "188": "accidentally",
    "189": "bit",
    "190": "friend's",
    "191": "tail",
    "192": "friend",
    "193": "upset",
    "194": "crying",
    "195": "felt",
    "196": "terrible",
    "197": "needed",
    "198": "from",
    "199": "made",
    "200": "sure",
    "201": "also",
    "202": "important",
    "203": "apologize",
    "204": "make",
    "205": "mistake",
    "206": "kind",
    "207": "others",
    "208": "together",
    "209": "extra",
    "210": "not",
    "211": "bite",
    "212": "anyone",
    "213": "again",
    "214": "red",
    "215": "barn",
    "216": "lot",
    "217": "hay",
    "218": "soft",
    "219": "yellow",
    "220": "nice",
    "221": "place",
    "222": "animals",
    "223": "sleep",
    "224": "tall",
    "225": "horse",
    "226": "sam",
    "227": "dependable",
    "228": "all",
    "229": "stand",
    "230": "by",
    "231": "them",
    "232": "everyone",
    "233": "liked",
    "234": "because",
    "235": "strong",
    "236": "chick",
    "237": "lost",
    "238": "find",
    "239": "her",
    "240": "stood",
    "241": "used",
    "242": "long",
    "243": "legs",
    "244": "move",
    "245": "finally",
    "246": "took",
    "247": "back",
    "248": "cheered",
    "249": "who",
    "250": "whale",
    "251": "deep",
    "252": "blue",
    "253": "sea",
    "254": "many",
    "255": "fish",
    "256": "crabs",
    "257": "problem",
    "258": "smelly",
    "259": "did",
    "260": "smell",
    "261": "thought",
    "262": "i",
    "263": "need",
    "264": "swam",
    "265": "covered",
    "266": "green",
    "267": "plants",
    "268": "rubbed",
    "269": "against",
    "270": "clean",
    "271": "were",
    "272": "happy",
    "273": "anymore",
    "274": "played",
    "275": "happily",
    "276": "ever",
    "277": "after",
    "278": "girl",
    "279": "amy",
    "280": "yard",
    "281": "purple",
    "282": "swing",
    "283": "high",
    "284": "sky",
    "285": "sunny",
    "286": "wow",
    "287": "!",
    "288": "want",
    "289": "smiled",
    "290": "okay",
    "291": "let's",
    "292": "turns",
    "293": "laughing",
    "294": "having",
    "295": "fun",
    "296": "swung",
    "297": "touch",
    "298": "while",
    "299": "tired",
    "300": "sat",
    "301": "down",
    "302": "grass",
    "303": "looked",
    "304": "at",
    "305": "each",
    "306": "other",
    "307": "have",
    "308": "spent",
    "309": "swinging",
    "310": "naughty",
    "311": "bee",
    "312": "buzzy",
    "313": "fly",
    "314": "bees",
    "315": "lucy",
    "316": "hi",
    "317": "yes",
    "318": "don't",
    "319": "how",
    "320": "moment",
    "321": "can",
    "322": "teach",
    "323": "we",
    "324": "pretty",
    "325": "flowers",
    "326": "taught",
    "327": "helped",
    "328": "sun",
    "329": "shining",
    "330": "brightly",
    "331": "clear",
    "332": "gentle",
    "333": "breeze",
    "334": "rustled",
    "335": "leaves",
    "336": "enjoying",
    "337": "beautiful",
    "338": "weather",
    "339": "park",
    "340": "taking",
    "341": "leisurely",
    "342": "stroll",
    "343": "along",
    "344": "riverbank",
    "345": "children",
    "346": "laughter",
    "347": "filled",
    "348": "air",
    "349": "as",
    "350": "turned",
    "351": "into",
    "352": "evening",
    "353": "temperature",
    "354": "drop",
    "355": "transformed",
    "356": "canvas",
    "357": "vibrant",
    "358": "colors",
    "359": "families",
    "360": "gathered",
    "361": "picnics",
    "362": "barbecues",
    "363": "wafted",
    "364": "through",
    "365": "perfect",
    "366": "picnic",
    "367": "lake",
    "368": "distance",
    "369": "sound",
    "370": "live",
    "371": "music",
    "372": "coming",
    "373": "local",
    "374": "band",
    "375": "began",
    "376": "gather",
    "377": "stage",
    "378": "enjoy",
    "379": "performance",
    "380": "atmosphere",
    "381": "electric",
    "382": "swaying",
    "383": "beat",
    "384": "stars",
    "385": "twinkle",
    "386": "night",
    "387": "crowd",
    "388": "grew",
    "389": "even",
    "390": "larger",
    "391": "festivities",
    "392": "well",
    "393": "joy",
    "394": "memories",
    "395": "last",
    "396": "lifetime"
  }
}